Velocet/iown-homecontrol/scripts/IDAPro/SVD/STM32F101-iown.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
<!-- File naming: <vendor>_<part/SeriesName>.svd -->
<!-- (C) iown-homecontrol. All rights reserved.

  Purpose: System Viewer Description (SVD) for STM32F101RC based io-homecontrol firmware (Schema Version 1.1).

  Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:
   - Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.
   - Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.
   - Neither the name of iown-homecontrol nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL COPYRIGHT HOLDERS AND CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

- AN2606: STM32 microcontroller system memory boot mode
  – AN3154: CAN protocol used in the STM32 bootloader
  – AN3155: USART protocol used in the STM32 bootloader
  – AN3156: USB DFU protocol used in the STM32 bootloader
  – AN4221: I2C protocol used in the STM32 bootloader
  – AN4286: SPI protocol used in the STM32 bootloader
  – AN5405: FDCAN protocol used in the STM32 bootloader

Register bank (32 bits) = 16 32-bit registers: R0-R15
  R0-R12 is a general-purpose register, used for data manipulation;
  R13 It is a stack pointer. CM3 provides two stack pointers for selection, but only one can be seen at the same time (banked):
    MSP: main stack pointer
    PSP: thread stack pointer.
    For the use of these two stack pointers they are parallel: When in the user app code, you can use MSP or PSP. By default, MSP is used, but only MSP can be used in the handler program. When the program jumps in these two modes, sometimes the stack pointer needs to be changed.
  R14 As the connection register (LR), it is used to store the return address when calling a subroutine;
  R15 It is the program counter register (PC), which points to the current program address (the current fetch address, not the address of the executed instruction, let alone the decoded address).
In addition to the above 16 registers, there are some special registers, including:
  program status registers (xPSR, three in one)
  interrupt mask registers (PRIMASK, FAULTMASK, BASEPRI)
  control Register (CONTROL)


Magic number:
 0x08192A3C = Used to secure boot code/data in flash

.code - 3E800 = 256kB
  0x0800 0000-0x0803 E800 ROM
  0x1FFF F000-0x1FFF F800 BOOT_1 (System Memory)
  0x1FFF F800-0x1FFF F880 Option Bytes
  0x1FFF F880-0x1FFF F900 Vendor Bytes
  0x1FFF F900-0x2000 0000 BOOT_2
.data - 0x8000 = 32kB
  0x2000 0000-0x2000 8000 BOOT_2
.peripherals
  0x4000 0000-0x4000 0400 TIM2
  0x4000 0400-0x4000 0800 TIM3
  0x4000 0800-0x4000 0C00 TIM4
  0x4000 2800-0x4000 2C00 RTC
  0x4000 2C00-0x4000 3000 WWDG
  0x4000 0000-0x4000 0000
  0x4000 0000-0x4000 0000
  0x4000 0000-0x4000 0000
  0x4000 0000-0x4000 0000
  0x4000 0000-0x4000 0000
  0x4000 0000-0x4000 0000
  0x4000 0000-0x4000 0000

You can start the internal bootloader by software as following:  2) set MSP/R13 to value from 0x1FFFF000 (normally 0x20000200)  3) Load address         from 0x1FFFF004 (normally 0x1FFFF021)

- ROM       0x00040000 256kB
            0x00000000-0x08040000 ROM ALIAS
            0x08000000-0x08040000 ROM (BANK 0)
            0x08000000-0x08002000 Bootloader
              0x08000000-0x08000200 Bootloader Vector Table (vtor)
                          0x08000000 Bootloader Stack Pointer
                          0x08000004 Bootloader ResetHandler
              0x08001FF0-0x08002000 Bootloader MD5
            0x08002800-0x08003FFF Application
              0x08002800-0x08003000 Application Vector Table (vtor)
                0x08002800-0x08002804 Application StackPointer
                0x08002804-0x08002808 Application ResetHandler
            0x08026038-0x0802A4D0 Data = Strings, Configs, etc.
              0x08029C0C-0x08029C18 Calibration Data (3x3 Matrix)
              0x08029CAC-0x08029DAC AES Sbox (256 Byte)
              0x08029DAC-0x08029DB6 AES rcon (Round Constants)
              0x08029DB8-0x08029DC8 Unknown (16 Byte)
              0x0802A31C-0x0802A41C crc-8-ccitt Table
              0x0802A41D-0x0802A428 SN12345678 (11 Byte)
              0x08029B5B-0x08029BFD Si446x Initial Config (see Si4461_radio.h)
            0x0803FFF0-0x08040000 Application MD5
- RAM       0x00008000 32kB
            0x20000000-0x20008000 RAM
            0x20000000-0x20000200 Internal Bootloader 512 Bytes RAM
            0x20000200-0x20008000 Application RAM
                        0x20007FF0 Reset Handler
            0x22000000-0x20008000 Bit band aliased

- System Config        0x00001000 4096Bytes = System Memory
            0x1FFFF000-0x1FFFF800 2048Bytes = Internal Bootloader
              0x1FFFF000-0x1FFFF021 Internal Bootloader vtor
                          0x1FFFF000 Internal Bootloader Stack Pointer (Default: 0x20000200)
                          0x1FFFF004 Internal Bootloader Reset Address (Default: 0x1FFFF021)
              0x1FFFF021-0x1FFFF800 Internal Bootloader Code
            0x1FFFF800-0x1FFFF80F OptionBytes
            0x1FFFF880-0x1FFFF900 VendorBytes
            0x1FFFF900-0x20000000 BOOT_2
- Peripherals
            0x40000000-0x40000400 TIM2
            0x40000400-0x40000800 TIM3
            0x40000800-0x40000C00 TIM4
            0x40002800-0x40002C00 RTC
            0x40002C00-0x40003000 WWDG
            0x40000000-0x40000000
            0x40000000-0x40000000
            0x40000000-0x40000000
            0x40000000-0x40000000
            0x40000000-0x40000000
            0x40000000-0x40000000
            0x40000000-0x40000000
 -->
  <vendor>iown-homecontrol</vendor>                               <!-- device vendor name -->
  <vendorID>IOWN</vendorID>                                       <!-- device vendor short name -->
  <name>STM32F101_iown</name>                                     <!-- name of part-->
  <series>CM3</series>                                       <!-- device series the device belongs to -->
  <version>1.3</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <description>STM32F101RC High Density (HD): 32-bit Cortex-M3 @ 36MHz with 32kB RAM & 256kB ROM</description>
  <licenseText>                                                   <!-- this license text will appear in header file. \n force line breaks -->
    iown-homecontrol (iown) is supplying this document for use with STM32F101 based microcontroller, but can be used for other suitable MCUs. This file can be freely distributed if modifications to this file are clearly marked.\n\n
    THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
  </licenseText>
  <cpu>                                                           <!-- details about the cpu embedded in the device -->
    <name>CM3</name>
    <revision>r1p1</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>4</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <!-- Bus Interface Properties -->
  <addressUnitBits>8</addressUnitBits>                            <!-- Cortex-M3 has byte addressable memory -->
  <width>32</width>                                               <!-- Maximum data bus bit width accessible within a single transfer == 32-bit -->
  <!--Register Properties: Default Settings implicitly inherited by Subsequent Sections -->
  <size>32</size>                                                 <!-- Default Size (Number of bits) of all Peripherals and Register that do not define "size" themselves -->
  <access>read-write</access>                                     <!-- Default Access Permission for all subsequent Registers -->
  <resetValue>0x00000000</resetValue>                             <!-- All bits of the Registers are initialized to 0 on Reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- All 32 bits of the Registers are used -->
  <peripherals>
    <peripheral>
      <name>FSMC</name>
      <description>Flexible static memory controller</description>
      <groupName>FSMC</groupName>
      <baseAddress>0xA0000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FSMC</name>
        <description>FSMC global interrupt</description>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>BCR1</name>
          <displayName>BCR1</displayName>
          <description>SRAM/NOR-Flash chip-select control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x000030D0</resetValue>
          <fields>
            <field>
              <name>CBURSTRW</name>
              <description>CBURSTRW</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CBURSTRW</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Write operations are always performed in asynchronous mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Write operations are performed in synchronous mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASYNCWAIT</name>
              <description>ASYNCWAIT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ASYNCWAIT</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Wait signal not used in asynchronous mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Wait signal used even in asynchronous mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTMOD</name>
              <description>EXTMOD</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EXTMOD</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Values inside the FMC_BWTR are not taken into account</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Values inside the FMC_BWTR are taken into account</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITEN</name>
              <description>WAITEN</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WAITEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Values inside the FMC_BWTR are taken into account</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>NWAIT signal enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WREN</name>
              <description>WREN</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WREN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Write operations disabled for the bank by the FMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Write operations enabled for the bank by the FMC</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITCFG</name>
              <description>WAITCFG</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WAITCFG</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>BeforeWaitState</name>
                  <description>NWAIT signal is active one data cycle before wait state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DuringWaitState</name>
                  <description>NWAIT signal is active during wait state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAITPOL</name>
              <description>WAITPOL</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WAITPOL</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>ActiveLow</name>
                  <description>NWAIT active low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ActiveHigh</name>
                  <description>NWAIT active high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BURSTEN</name>
              <description>BURSTEN</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BURSTEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Burst mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Burst mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FACCEN</name>
              <description>FACCEN</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FACCEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Corresponding NOR Flash memory access is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Corresponding NOR Flash memory access is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MWID</name>
              <description>MWID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MWID</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Bits8</name>
                  <description>Memory data bus width 8 bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bits16</name>
                  <description>Memory data bus width 16 bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bits32</name>
                  <description>Memory data bus width 32 bits</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MTYP</name>
              <description>MTYP</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MTYP</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>SRAM</name>
                  <description>SRAM memory type</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSRAM</name>
                  <description>PSRAM (CRAM) memory type</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Flash</name>
                  <description>NOR Flash/OneNAND Flash</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUXEN</name>
              <description>MUXEN</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MUXEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Address/Data non-multiplexed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Address/Data multiplexed on databus</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBKEN</name>
              <description>MBKEN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MBKEN</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Corresponding memory bank is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Corresponding memory bank is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRAPMOD</name>
              <description>WRAPMOD</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPSIZE</name>
              <description>CRAM page size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CPSIZE</name>
                <usage>read-write</usage>
                <enumeratedValue>
                  <name>NoBurstSplit</name>
                  <description>No burst split when crossing page boundary</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bytes128</name>
                  <description>128 bytes CRAM page size</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bytes256</name>
                  <description>256 bytes CRAM page size</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bytes512</name>
                  <description>512 bytes CRAM page size</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bytes1024</name>
                  <description>1024 bytes CRAM page size</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
